
# 084   비어있는 딕셔너리 만들기
temp = { }

# 085   딕셔너리 구성하기
i = {'메로나' : 1000,
    '폴라포' : 1200,
    '빵빠레' : 1800}

# 086   정보 추가하기
i = {'메로나' : 1000,
    '폴라포' : 1200,
    '빵빠레' : 1800,
    '죠스바' : 1200,
    '월드콘' : 1500}

# 087   가격 출력하기
i = {'메로나' : 1000,
    '폴라포' : 1200,
    '빵빠레' : 1800,
    '죠스바' : 1200,
    '월드콘' : 1500}
i['메로나'] = 1000

# 088   가격 수정하기
i = {'메로나' : 1000,
    '폴라포' : 1200,
    '빵빠레' : 1800,
    '죠스바' : 1200,
    '월드콘' : 1500}
i['메로나'] = 1300

# 089
i = {'메로나' : 1000,
    '폴라포' : 1200,
    '빵빠레' : 1800,
    '죠스바' : 1200,
    '월드콘' : 1500}
del i['메로나']

# 090
# 딕셔너리로 추가해야 하는데 리스트로 추가해서


